Repository: AsimanGasimzada/MotorDoctor
Catalog: MotorDoctor.Presentation/Resources/Resources.*.resx
Languages: az

# ConcurrencyFailure
source: Concurrency error occurred.
az: Uyğunlaşma xətası baş verdi.

# DefaultError
source: An unknown error occurred.
az: Naməlum xəta baş verdi.

# DuplicateEmail
source: '{0}' email is already in use.
az: '{0}' email artıq istifadə olunur.

# DuplicateRoleName
source: '{0}' role already exists.
az: '{0}' rol artıq mövcuddur.

# DuplicateUserName
source: '{0}' username is already taken.
az: '{0}' istifadəçi adı artıq götürülüb.

# InvalidEmail
source: '{0}' email is invalid.
az: '{0}' email etibarsızdır.

# InvalidRoleName
source: '{0}' role is invalid.
az: '{0}' rol etibarsızdır.

# InvalidToken
source: Token is invalid.
az: Token etibarsızdır.

# InvalidUserName
source: '{0}' username is invalid.
az: '{0}' istifadəçi adı etibarsızdır.

# LoginAlreadyAssociated
source: This login is already associated with another user.
az: Bu giriş artıq başqa bir istifadəçi ilə əlaqələndirilib.

# PasswordMismatch
source: Password is incorrect.
az: Şifrə yanlışdır.

# PasswordRequiresDigit
source: Password must contain at least one digit ('0'-'9').
az: Şifrə ən azı bir rəqəm ('0'-'9') içerməlidir.

# PasswordRequiresLower
source: Password must contain at least one lowercase letter ('a'-'z').
az: Şifrə ən azı bir kiçik hərf ('a'-'z') içerməlidir.

# PasswordRequiresNonAlphanumeric
source: Password must contain at least one non-alphanumeric character.
az: Şifrə ən azı bir qeyri-alfanumerik simvol içerməlidir.

# PasswordRequiresUniqueChars
source: Password must contain at least {0} unique characters.
az: Şifrə ən azı {0} unikal simvol içerməlidir.

# PasswordRequiresUpper
source: Password must contain at least one uppercase letter ('A'-'Z').
az: Şifrə ən azı bir böyük hərf ('A'-'Z') içerməlidir.

# PasswordTooShort
source: Password must be at least {0} characters long.
az: Şifrə ən azı {0} simvol uzunluğunda olmalıdır.

source: Recovery code redemption failed.
az: Qurtarma kodunun geri alınması baş tutmadı.

# UserAlreadyHasPassword
source: User already has a password set.
az: İstifadəçinin artıq bir şifrəsi var.

# UserAlreadyInRole
source: User is already in role '{0}'.
az: İstifadəçi artıq '{0}' rolundadır.

# UserLockoutNotEnabled
source: User lockout is not enabled.
az: İstifadəçi üçün kilidləmə aktiv deyil.

# UserNotInRole
source: User is not in role '{0}'.
az: İstifadəçi '{0}' rolunda deyil.
